articles/VoidLinux/index.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2021-06-16 Wed 07:54 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Void Linux</title>
<meta name="generator" content="Org mode">
<link rel="stylesheet" type="text/css" href="../../styles.css">
</head>
<body>
<div id="content">
<h1 class="title">Void Linux</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org8f96de0">1. Big Musls</a></li>
<li><a href="#org5503c66">2. Install Process</a></li>
<li><a href="#orgc8b4a42">3. System Configuration 1 </a></li>
<li><a href="#org8f225d4">4. Package Repositories</a></li>
<li><a href="#org87f6358">5. Development Team</a></li>
</ul>
</div>
</div>
<p>
From the <a href="https://voidlinux.org">website</a> &#x2026;
</p>

<blockquote>
<p>

</p>

<p>
"Void is a general purpose operating system, based on the monolithic Linux kernel. Its package system allows you to quickly install, update and remove software; software is provided in binary packages or can be built directly from sources with the help of the XBPS source packages collection."
</p>
</blockquote>

<p>
This was my first minimal Linux distribution. This is to serve as an ongoing review for my use and interaction with my two machines running the operating system.
</p>

<div id="outline-container-org8f96de0" class="outline-2">
<h2 id="org8f96de0"><span class="section-number-2">1</span> Big Musls</h2>
<div class="outline-text-2" id="text-1">
<p>
I chose the musl version of Void, for almost no reason than to try it out. On the whole, it hasn't made a difference for me a bit. Maybe because I don't know my computer well enough to understand the advantages, but also I don't do anything too low leve on the operating system. All I can say is that I now can't use WideVine to watch Netflix on Void (which is fine; I can watch it on Windows). That gap, however, makes my work machine, well, a work machine. The most distracting thing I can do is watch Youtube, which I don't do anyways.
</p>
</div>
</div>

<div id="outline-container-org5503c66" class="outline-2">
<h2 id="org5503c66"><span class="section-number-2">2</span> Install Process</h2>
<div class="outline-text-2" id="text-2">
<p>
I loved the install process. It made the installation easy. A nice TUI interface guides you through everything that would go into a `chroot`-ed installation, no mess, no fuss, exit any time. That said, I neglected some of the finer details of the installation process, maybe because I was too preoccupied with the nice interface. It requires quite a bit of knowledge about installing linux (e.g. partitioning, addusr, passwd, etc.). I think if there is a next time, I will opt for a chroot installation.
</p>
</div>
</div>

<div id="outline-container-orgc8b4a42" class="outline-2">
<h2 id="orgc8b4a42"><span class="section-number-2">3</span> System Configuration <a href="#org42c13c4">3</a> <a id="org42c13c4"></a></h2>
<div class="outline-text-2" id="text-3">
<div class="sidenote div" id="orgaffd5f4">
<p>
<a href="#org42c13c4">3</a> You should read <a href="https://docs.voidlinux.org/config/index.html">the manual</a>.
</p>

</div>

<p>
This is all pretty standard for a Linux system. The biggest difference is the one Void prides itself on, the use of runit as an init service. For those of you not familiar, the init system is the first process in the operating system. It also manages processes, killing dead ('zombie') processes, and manages services. The CLI is easy to use, a simple `sudo sv up $SERVICE ` starts a service, and soft-linking a directory to the /var/service directory marks a systems to be enabled. Not bad at all.
</p>
</div>
</div>

<div id="outline-container-org8f225d4" class="outline-2">
<h2 id="org8f225d4"><span class="section-number-2">4</span> Package Repositories</h2>
<div class="outline-text-2" id="text-4">
<p>
This is where I feel most disappointed with Void; I think the repositories are lacking. I would like to see more of small stuff. There hasn't been any deal-breaking packages I haven't been able to find, but I am consistently disappointed with my small searches. There's not much community around Void.
</p>
</div>
</div>

<div id="outline-container-org87f6358" class="outline-2">
<h2 id="org87f6358"><span class="section-number-2">5</span> Development Team</h2>
<div class="outline-text-2" id="text-5">
<p>
This is another point of disappointment with Void. Their main developer (xtraeme) has been acting somewhat erratically. He was apparently a pain to work with (not a claim I've seen him refute) and got booted off the team, and his account on GitHub got suspended. Then he continues writing programs and packages for Void and posting them to Reddit.  ==
</p>

<p>
But on a more concrete note, there hasn't been a release of iso in over a year. I fear the system is soon to be dead. The only serious users are a couple of ricers over on /r/unixporn. The major roles filled by minimal operating systems are filled. Even Void's claim to fames are not unique or even special, <a href="https://distrowatch.com/search.php?ostype=All&amp;category=All&amp;origin=All&amp;basedon=All&amp;notbasedon=None&amp;desktop=All&amp;architecture=All&amp;package=All&amp;rolling=All&amp;isosize=All&amp;netinstall=All&amp;language=All&amp;defaultinit=Not+systemd&amp;status=Active#simple">a search on Distrowatch</a> shows many non-systemd init systems, and runit shows a far more popular distro, antiX. There is really nothing to make Void stand out anymore.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2021-06-16 Wed 07:54</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
